## Importing libraries

In [0]:
import pandas as pd
import numpy as np
df_csv = pd.read_csv("/content/brand_details.csv")

In [7]:
print(df_csv.columns)

Index(['Rank', 'Brand', 'Brand_Value', 'Change_LastYr', 'Brand_Revenue',
       'Company_Advertising', 'Industry'],
      dtype='object')

In [8]:
df_csv.head()

   Rank      Brand  Brand_Value  ...  Brand_Revenue  Company_Advertising    Industry
0     1      Apple        145.3  ...          182.3                  1.2  Technology
1     2  Microsoft         69.3  ...           93.3                  2.3  Technology
2     3     Google         65.6  ...           61.8                  3.0  Technology
3     4  Coca-Cola         56.0  ...           23.1                  3.5   Beverages
4     5        IBM         49.8  ...           92.8                  1.3  Technology

[5 rows x 7 columns]

#Problem 1 - Which industry has the maximum brands whose Brand_Revenue > 80 Million (Brand revenue is in millions)

In [56]:
df_csv.loc[(df_csv.groupby(['Industry'])['Brand'].count().max())][['Industry']]

Industry    Technology
Name: 13, dtype: object

Since the technology has maximum number of brands so i have inferred from above code that that Industry technology has maximum no of Brand so that Brand_Revenue>80 of technology is defined by below code.

In [55]:
df_csv.loc[(df_csv.Industry=='Technology') & (df_csv.Brand_Revenue>80)][['Industry','Brand','Brand_Revenue']]

      Industry            Brand  Brand_Revenue
0   Technology            Apple          182.3
1   Technology        Microsoft           93.3
4   Technology              IBM           92.8
6   Technology          Samsung          187.8
11  Technology           Amazon           87.5
25  Technology  Hewlett-Packard          111.5

# Problem 2 - List the companies whose Company_Advertising budget is < 3 but Brand_Value is > 20

In [21]:
df_csv.loc[(df_csv["Company_Advertising"]<3) & (df_csv['Brand_Value']>20)][['Industry','Brand','Brand_Value','Company_Advertising']]

       Industry      Brand  Brand_Value  Company_Advertising
0    Technology      Apple        145.3                1.200
1    Technology  Microsoft         69.3                2.300
4    Technology        IBM         49.8                1.300
5   Restaurants  McDonalds         39.5                0.808
8    Technology   Facebook         36.5                0.135
9       Leisure     Disney         34.6                2.800
13   Technology      Cisco         27.6                0.196
14   Technology     Oracle         26.8                0.079
16   Technology      Intel         25.8                1.800
17       Retail   Wal-Mart         24.7                2.400
18      Telecom    Verizon         24.5                2.500
20   Automotive      Honda         22.6                2.700

#Problem 3 - Find out the top 5 Technology Brand that showed maximum positive jump in their position (Use Change_LastYr)

In [36]:
df_csv.head(10)

   Rank      Brand  ...  Company_Advertising     Industry
0     1      Apple  ...                1.200   Technology
1     2  Microsoft  ...                2.300   Technology
2     3     Google  ...                3.000   Technology
3     4  Coca-Cola  ...                3.500    Beverages
4     5        IBM  ...                1.300   Technology
5     6  McDonalds  ...                0.808  Restaurants
6     7    Samsung  ...                3.800   Technology
7     8     Toyota  ...                3.800   Automotive
8    10   Facebook  ...                0.135   Technology
9    11     Disney  ...                2.800      Leisure

[10 rows x 7 columns]

In [48]:
s=df_csv[(df_csv['Industry']=='Technology')]
s.nlargest(5,['Change_LastYr'])[['Change_LastYr','Industry']]

    Change_LastYr    Industry
8              54  Technology
11             32  Technology
33             21  Technology
50             21  Technology
0              17  Technology

# Problem 4 - Find out the Average Brand_Revenue by Industry

In [45]:
df_csv.groupby(['Industry'])['Brand_Revenue'].mean()

Industry
Apparel                     17.700000
Automotive                  97.385714
Beverages                   13.133333
Business Services           32.800000
Consumer Packaged Goods      7.175000
Financial Services          51.622222
Heavy Equipment             36.100000
Leisure                     26.400000
Luxury                       5.900000
Media                        9.200000
Restaurants                 51.900000
Retail                     156.266667
Technology                  80.238462
Telecom                    129.750000
Transportation              47.200000
Name: Brand_Revenue, dtype: float64